<a href="https://colab.research.google.com/github/harika62/batch_19-2303a51262/blob/main/lab5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [5]:
import pandas as pd
data=[10,20,30,40,50]
index_labels=['a','b','c','d','e']
series=pd.Series(data,index=index_labels)
print(series)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [6]:
import pandas as pd
data=[10,20,30,40,50]
series=pd.Series(data)
print(series)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [7]:
import pandas as pd

data={
    'Name':['Alice','Bob','Charlie','David'],
    'Age':[25,30,35,40],
    'City':['Hyderabad','Delhi','Chennai','Mumbai']
}

df=pd.DataFrame(data)

print("Pandas DataFrame:")
print(df)

Pandas DataFrame:
      Name  Age       City
0    Alice   25  Hyderabad
1      Bob   30      Delhi
2  Charlie   35    Chennai
3    David   40     Mumbai

In [9]:
#access a single column
print(df['Name'])

0      Alice
1        Bob
2    Charlie
3      David
Name: Name, dtype: object

In [11]:
#accessing multiple columns
print(df[['Name','City']])

      Name       City
0    Alice  Hyderabad
1      Bob      Delhi
2  Charlie    Chennai
3    David     Mumbai

In [13]:
#access rows using index
print("Accessing row 1 using iloc:")
print(df.iloc[1])

print("\nAccessing row with index 0 using loc:")
print(df.loc[0])

Accessing row 1 using iloc:
Name      Bob
Age        30
City    Delhi
Name: 1, dtype: object

Accessing row with index 0 using loc:
Name        Alice
Age            25
City    Hyderabad
Name: 0, dtype: object

In [16]:
df['Salary']=[40000,50000,60000,70000]
print(df)

      Name  Age       City  Salary
0    Alice   25  Hyderabad   40000
1      Bob   30      Delhi   50000
2  Charlie   35    Chennai   60000
3    David   40     Mumbai   70000

In [18]:
df=df.drop('City',axis=1)
print(df)

      Name  Age  Salary
0    Alice   25   40000
1      Bob   30   50000
2  Charlie   35   60000
3    David   40   70000

In [15]:
#select rows where age>30
print(df[df['Age']>30])

      Name  Age     City
2  Charlie   35  Chennai
3    David   40   Mumbai

In [19]:
print(df['Age'].mean())
print(df['Age'].max())
print(df['Age'].min())

32.5
40
25

In [21]:
#creating a dataframe with student details
student_data={
    'student_id':[101,102,103,104],
    'name':['ravi','neha','kiran','sita'],
    'marks':[85,90,78,92],
    'department':['cse','ece','mech','cse']
}
df=pd.DataFrame(student_data)
print("student data:")
print(df)

student data:
   student_id   name  marks department
0         101   ravi     85        cse
1         102   neha     90        ece
2         103  kiran     78       mech
3         104   sita     92        cse